const quizData = [
  {
    "question": "பட்டாடை அணியும் மாந்தர்கள் யார் யார்",
    "options": [
      "கொல்லர்",
      "புலவர்",
      "நெசவாளர்",
      "அரசன், வணிகர்"
    ],
    "correct": "அரசன், வணிகர்"
  },
  {
    "question": "கிழ்கண்ட புலவர்களில் யார் ஆடை விற்பனை செய்தனர்",
    "options": [
      "கபிலர்",
      "ஒளவையார்",
      "நக்கீரர்",
      "இளவேட்டனார்"
    ],
    "correct": "இளவேட்டனார்"
  },
  {
    "question": "ஆதி கால மனிதன் எவ்வகையான ஆடையை பயன்படுத்தினான்",
    "options": [
      "மர நார்கள்",
      "மரத் தழைகள்",
      "இவை அனைத்தும்",
      "மிருகங்களின் தோல்"
    ],
    "correct": "இவை அனைத்தும்"
  },
  {
    "question": "நெசவுத் தொழிலில் ஈடுபட்ட புலவர்கள் யார்",
    "options": [
      "கபிலர்",
      "வள்ளுவர், கம்பர்",
      "இளங்கோவடிகள்",
      "ஒட்டக்கூத்தர்"
    ],
    "correct": "வள்ளுவர், கம்பர்"
  },
  {
    "question": "உடை உற்பத்தி செய்யக்கூடிய மகளிரை எவ்வாறு அழைத்தனர்",
    "options": [
      "பரித்திப் பெண்டிர்",
      "கைம்பெண்",
      "ஆடை செய்யும் பெண்டிர்",
      "முதிர் கண்ணியர்"
    ],
    "correct": "பரித்திப் பெண்டிர்"
  },
  {
    "question": "துகில் ஆடை எதைக் கொண்டு தயாரிக்கப்படுகிறது",
    "options": [
      "பட்டு",
      "பருத்தி",
      "பாம்பின் தோல்",
      "மூங்கில் நார்"
    ],
    "correct": "பருத்தி"
  },
  {
    "question": "பருத்தி ஆடையைக் கீழ்கண்ட எந்த நாட்டிற்கு ஏற்றுமதி செய்தனர்",
    "options": [
      "இவை அனைத்தும்",
      "கிரேக்கம்",
      "எகிப்து",
      "சீனா"
    ],
    "correct": "இவை அனைத்தும்"
  },
  {
    "question": "தக்களி என்பது எதனைக் குறிக்கும்",
    "options": [
      "கருங்கல்",
      "சக்கரம்",
      "குண்டு",
      "ஊசி"
    ],
    "correct": "சக்கரம்"
  },
  {
    "question": "கீழடியில் கிடைத்த சுடுமண் உருவங்கள் எவை",
    "options": [
      "மனிதன் மற்றும் விலங்கு",
      "பானை ஓடுகள்",
      "வட்டச்சில்லுகள்",
      "சக்கரங்கள்"
    ],
    "correct": "மனிதன் மற்றும் விலங்கு"
  },
  {
    "question": "கயிறுக்கு வழங்கப்படும் வேறு பெயர்கள்",
    "options": [
      "நூல் சரடு",
      "வேள்விக் கயிறு",
      "இவை அனைத்தும்",
      "முத்துக் கோர்க்கும் நூல்"
    ],
    "correct": "இவை அனைத்தும்"
  },
  {
    "question": "கீறல்கள் என்பது எதனைக் குறிக்கும்",
    "options": [
      "வரி வடிவம்",
      "எழுதுதல்",
      "வட்டமிடுதல்",
      "வரைதல்"
    ],
    "correct": "வரி வடிவம்"
  },
  {
    "question": "மண் என்ற சொல்லைக் குறிக்கும் பெயர்",
    "options": [
      "மண் அணு",
      "இவை அனைத்தும்",
      "துகள்",
      "மலை"
    ],
    "correct": "இவை அனைத்தும்"
  },
  {
    "question": "தமிழர்கள் ஆடைகளில் எவ்வகையான வண்ணத்தினை பயன்படுத்தினர்",
    "options": [
      "கருப்பு மற்றும் வெள்ளை",
      "வெள்ளை மற்றும் நீலம்",
      "நீலம் மற்றும் சிவப்பு",
      "பச்சை மற்றும் கருப்பு"
    ],
    "correct": "நீலம் மற்றும் சிவப்பு"
  },
  {
    "question": "மட்பாண்டங்கள் தயாரிக்கப் பயன்படும் மண்",
    "options": [
      "செம்மண்",
      "துருக்கல் மண்",
      "களிமண்",
      "வண்டல் மண்"
    ],
    "correct": "களிமண்"
  },
  {
    "question": "நீண்ட நாள் நீடித்திருக்கும் பாண்டங்கள்",
    "options": [
      "கதிரவன் ஒளி பட்ட",
      "சுட்ட பாண்டங்கள்",
      "சுடுப்படாத பாண்டங்கள்",
      "இருளில் வைக்கப்படும்"
    ],
    "correct": "சுட்ட பாண்டங்கள்"
  },
  {
    "question": "கீழடியில் கிடைத்த சிவப்பு நிற பாணைகளில் பயன்படுத்திய தாது பொருள்கள்",
    "options": [
      "இரும்பு தாது",
      "தாமிரத்தாது",
      "அலுமினியத் தாது",
      "கரி"
    ],
    "correct": "இரும்பு தாது"
  },
  {
    "question": "குறியீடு கொண்ட பாணை ஓடுகள் கிடைக்கும் இடம்",
    "options": [
      "ஆதிச்சநல்லூர்",
      "உறையூர்",
      "இவை அனைத்தும்",
      "மாங்குளம்"
    ],
    "correct": "இவை அனைத்தும்"
  },
  {
    "question": "கீழ்கண்ட நாடுகளில் எங்கு கீறல் குறியீடு கொண்ட பாணை ஓடுகள் கிடைத்தன.",
    "options": [
      "இலங்கை",
      "பர்மா",
      "மலேசியா",
      "சிங்கப்பூர்"
    ],
    "correct": "இலங்கை"
  },
  {
    "question": "மட்பாண்டங்களின் நிறங்கள் எவை",
    "options": [
      "கருப்பு மற்றும் சிவப்பு",
      "கருப்பு மற்றும் ஊதா",
      "வெள்ளை மற்றும் மஞ்சள்",
      "பச்சை மற்றும் சிவப்பு"
    ],
    "correct": "கருப்பு மற்றும் சிவப்பு"
  },
  {
    "question": "பாணைகளில் பொறிக்கப் பட்ட எழுத்துகள்",
    "options": [
      "தமிழ் - கிரந்தம்",
      "தமிழ் -பிராமி",
      "வட்டெழுத்துகள்",
      "இவை அனைத்தும்"
    ],
    "correct": "தமிழ் - பிராமி"
  },
  {
    "question": "அகழாய்வில் சங்க காலத் தமிழ் எழுத்து கல்வெட்டுகள் எத்தனை கிடைத்தன.",
    "options": [
      "210",
      "110",
      "10",
      "310"
    ],
    "correct": "110"
  },
  {
    "question": "கீழடி அகழாய்வில் தமிழி எழுத்து பொறிக்கப்பட்ட எத்தனை பானை ஓடுகள் கிடைத்தன.",
    "options": [
      "36",
      "46",
      "56",
      "26"
    ],
    "correct": "56"
  },
  {
    "question": "பானைகளில் பொறிக்கப்பட்ட ஆட்பெயர்கள் என்ன",
    "options": [
      "குவிரன், அதன்",
      "காரி",
      "அகரன், பாரி",
      "பரிதி, அதியமான்"
    ],
    "correct": "குவிரன், அதன்"
  },
  {
    "question": "கருப்பு சிவப்பு பானைகளை எத்தனை டிகிரி வெப்பநிலையில் சூடுப்படுத்தினர்.",
    "options": [
      "2100",
      "1100",
      "3100",
      "110"
    ],
    "correct": "1100"
  },
  {
    "question": "மண்பாண்டங்களுக்கு வழங்கப்படும் வேறு பெயர்.",
    "options": [
      "மிடா",
      "குழிசி",
      "தசும்பு",
      "இவை அனைத்தும்"
    ],
    "correct": "இவை அனைத்தும்"
  },
  {
    "question": "கீழடியில் கிடைத்த பானை ஓடுகளில் எத்தனை நானோ குழாய்கள் உள்ளது.",
    "options": [
      "ஒற்றை மற்றும் பல்சுவர்",
      "இரட்டை மற்றும் ஒற்றை",
      "பல்சுவர் மற்றும் இரட்டை",
      "மூன்று மற்றும் ஒற்றை"
    ],
    "correct": "ஒற்றை மற்றும் பல்சுவர்"
  },
  {
    "question": "சங்ககாலத் தமிழர் நூல் கயிற்றை எவற்றுக்கெல்லாம் பயன்படுத்தினர்",
    "options": [
      "குவளை மலர்",
      "தாமரை மலர்",
      "முத்து",
      "இவை அனைத்தும்"
    ],
    "correct": "இவை அனைத்தும்"
  },
  {
    "question": "சங்ககாலத் தமிழர் நாரை எவற்றுக்கெல்லாம் பயன்படுத்தினர்",
    "options": [
      "இவை அனைத்தும்",
      "அத்திப்பூ",
      "வேப்பம் பூ",
      "முல்லைப்பூ"
    ],
    "correct": "இவை அனைத்தும்"
  },
  {
    "question": "ஆதிச்ச நல்லூர் அகழாய்வில் கிடைத்த பொருட்கள்",
    "options": [
      "நூல் நூற்கும் தக்களிகள்",
      "பஞ்சாடை",
      "தசும்பு",
      "கருங்கல்"
    ],
    "correct": "பஞ்சாடை"
  },
  {
    "question": "கொடுமணல் அகழாய்வில் கிடைத்த பொருட்கள்",
    "options": [
      "மண்வெட்டி",
      "கொழு",
      "உமி",
      "நூல் நூற்கும் தக்களிகள்"
    ],
    "correct": "நூல் நூற்கும் தக்களிகள்"
  },
  {
    "question": "பருத்திவேலிச் சீறூர் என்று பாடிய பெண்புலவர் யார்",
    "options": [
      "ஒளவையார்",
      "பொன்முடியார்",
      "காக்கை பாடினியார்",
      "புனிதவதியார்"
    ],
    "correct": "பொன்முடியார்"
  },
  {
    "question": "பருத்திவேலிச் சீறூரின் மன்னன் என யாரை குறிப்பிடுகிறார்.",
    "options": [
      "பாரி",
      "ஓரி",
      "ஒரி",
      "அதியமான்"
    ],
    "correct": "அதியமான்"
  },
  {
    "question": "பருத்தி இழையிலிருந்து தயாரிக்கப்படும் ஆடை",
    "options": [
      "பட்டாடை",
      "நூலாடை",
      "உரியாடை",
      "தழையாடை"
    ],
    "correct": "நூலாடை"
  },
  {
    "question": "கருப்பு, சிவப்பு பாண்டங்களின் பண்பாடு எக்காலத்திற்கு இடையே தோன்றியது.",
    "options": [
      "புதியகற்காலம்",
      "இரும்புக்காலம்",
      "கற்காலம்",
      "இவையனைத்தும்"
    ],
    "correct": "இரும்புக்காலம்"
  },
  {
    "question": "கருப்பு, சிவப்புக் பாண்டங்களின் காலம்",
    "options": [
      "கி.மு 1450-1200",
      "கி.மு 1350-1100",
      "கி.மு 1250-1100",
      "கி.மு 1150-1200"
    ],
    "correct": "கி.மு 1450-1200"
  },
  {
    "question": "கீழடியில் கிடைத்த நானோ குழாய்கள் எத்தனை வருடங்களுக்கு முந்தியவை",
    "options": [
      "3,400",
      "2,400",
      "1,400",
      "4,400"
    ],
    "correct": "2,400"
  },
  {
    "question": "கார்பன் நானோ குழாய்கள் உருவாக எத்தனை டிகிரி செல்சியஸ் வெப்பம் தேவை",
    "options": [
      "1,200",
      "1,100",
      "2,200",
      "1,250"
    ],
    "correct": "1,200"
  },
  {
    "question": "நானோ குழாய்கள் கண்டறியப்பட பிறநாடுகள்",
    "options": [
      "அமெரிக்கா",
      "டமாஸ்கஸ்",
      "கிரேக்கம்",
      "சீனா"
    ],
    "correct": "டமாஸ்கஸ்"
  },
  {
    "question": "கிழடியில் கிடைத்த பாணைகளில் தமிழி எழுத்துகள் எப்பொழுது பொறிக்கப்பட்டது.",
    "options": [
      "வனையும் போது",
      "உலர்ந்த பின்பு",
      "ஈரநிலையில்",
      "இவையனைத்தும்"
    ],
    "correct": "உலர்ந்த பின்பு"
  },
  {
    "question": "கருப்பு வண்ணம் பளபளப்புத் தன்மை குறையாமல் இருப்பதற்கு காரணம்",
    "options": [
      "கார்பன் நானோ குழாய்கள்",
      "கார்பன் டை ஆக்சைடு",
      "கார்பன் மோனாக்சைடு",
      "கார்பன் டை மோனாக்சைடு"
    ],
    "correct": "கார்பன் நானோ குழாய்கள்"
  },
  {
    "question": "ஆடையில்லா மனிதன் ....... ஆவான்.",
    "options": [
      "முழுமனிதன்",
      "அரைமனிதன்",
      "ஆண்டி",
      "ஞானி"
    ],
    "correct": "அரைமனிதன்"
  },
  {
    "question": "மனிதனின் அடிப்படைத் தேவைகளுள் ஒன்று",
    "options": [
      "நீர்",
      "காற்று",
      "ஆடை",
      "வெளிச்சம்"
    ],
    "correct": "ஆடை"
  },
  {
    "question": "....... ஆனாலும் கசக்கி கட்டு",
    "options": [
      "கந்தையானாலும்",
      "கூழானாலும்",
      "நீரானாலும்",
      "அமிர்தமானாலும்"
    ],
    "correct": "கந்தையானாலும்"
  },
  {
    "question": "உடுப்பதற்கு ....... உடைகள் இன்றியமையாதது",
    "options": [
      "மூன்று",
      "இரண்டு",
      "நான்கு",
      "ஒன்று"
    ],
    "correct": "இரண்டு"
  },
  {
    "question": "உண்பதற்கு ....... உணவு என புறநானூறு கூறுகிறது.",
    "options": [
      "நாழி",
      "ஆழாக்கு",
      "குறுணி",
      "பதக்கு"
    ],
    "correct": "நாழி"
  },
  {
    "question": "நெசவுக் கலைப் பற்றி பேசும் நூல்",
    "options": [
      "பதிற்றுப்பத்து",
      "பரிபாடால்",
      "குறுந்தொகை",
      "நற்றிணை"
    ],
    "correct": "பரிபாடால்"
  },
  {
    "question": "சங்க காலத்தில் நெசவுத் தொழிலுக்கு வழங்கப்பட்ட வேறு பெயர்",
    "options": [
      "காருகவினை",
      "கைத்தறி",
      "நூல்நூற்றல்",
      "ஆடை நெய்தல்"
    ],
    "correct": "காருகவினை"
  },
  {
    "question": "சங்க காலத்தில் மிக மெல்லிய ஆடைகள் எங்கு நெய்யப்பட்டன.",
    "options": [
      "திருப்பூர்",
      "கொற்கை",
      "காஞ்சி",
      "தஞ்சை"
    ],
    "correct": "காஞ்சி"
  },
  {
    "question": "நானோ தொழில்நுட்பம் என்பது",
    "options": [
      "மிகச் சிறிய அளவில் பொருட்களை உருவாக்குதல்",
      "மிக மிகச் சிறிய அளவில் பொருட்களை உருவாக்குதல்",
      "மிகப் பெரிய அளவில் பொருட்களை உருவாக்குதல்",
      "மிக மிகப் பெரிய அளவில் பொருட்களை உருவாக்குதல்"
    ],
    "correct": "மிக மிகச் சிறிய அளவில் பொருட்களை உருவாக்குதல்"
  },
  {
    "question": "தமிழ் நாட்டில் சிந்துவெளி குறியீடு எங்கு கிடைக்கின்றன.",
    "options": [
      "ஆதிச்சநல்லூர்",
      "கிழடி",
      "அழகன்குளம்",
      "தர்மபுரி"
    ],
    "correct": "அழகன்குளம்"
  }
]
